function typeStr=mapId2TypeString2TH(classId)
classTable={
    'notSign','20','25','30','45','60','80','แยก','แยก','แยก','แยก','สะพาน','เกาะกลาง','ทางร่วม','ไฟแดง','กลับรถ','โค้งซ้าย','คนข้าม1'...,
    'คนข้าม2','ชิดซ้าย','วงเวียน','ห้ามจอด','เนิน','เครื่องบิน','ห้ามแซง','ห้ามเลี้ยวซ้าย','ห้ามหยุด','รถสวนมาก่อน','ห้ามมอไซ','ห้ามผ่าน','หยุด','ตรงไป','เลี้ยวขวา'...,
    'จักรยาน','ห้ามกลับรถ','ไปซ้ายหรือขวา','ห้ามจอด','ตรงหรือขวา','เข้า','ออก','จอดได้','ข้างหน้าเลี้ยวขวาได้','โค้งขวา','โค้งซิกแซก','ขับตรงไป','ทางร่วมระวังขวา'...,
    'ให้เลี้ยวซ้าย','4แยก','ให้ทางหลักไปก่อน','ห้ามเลี้ยวซ้าย','ห้ามไปทางซ้าย'
};
typeStr=classTable(classId);
end


